Narin-Laboratory/libudawa-esp32/src/libudawa.h
  wifiKeeperLoop.enable();
  setAlarm(0, 0, 3, 100);
}


void cbSubscribe(const GCB *callbacks, size_t callbacksSize)
{
  for (size_t i = 0; i < callbacksSize; ++i) {
    m_gcb[i] = callbacks[i];
  }
}

void runCb(const char *methodName, JsonObject &params){
  for (size_t i = 0; i < sizeof(m_gcb) / sizeof(*m_gcb); ++i) {
    if (m_gcb[i].m_cb && !strcmp(m_gcb[i].m_name, methodName)) {
      log_manager->debug(PSTR(__func__), PSTR("calling generic RPC: %s\n"), m_gcb[i].m_name);
      m_gcb[i].m_cb(params);
      break;
    }
  }
}

bool ifaceLoopEnable(){
  if(WiFi.isConnected() && config.fIface){
    web.begin();
    web.serveStatic("/", SPIFFS, "/www/").setDefaultFile("index.html").setAuthentication(config.htU,config.htP);
    ws.onEvent(onWsEventCb);
    ws.setAuthentication(config.htU, config.htP);
    ws.enable(true);
    web.addHandler(&ws);
    return true;
  }
  return false;
}

void ifaceLoopCb(){
  ws.cleanupClients();
}

void ifaceLoopDisable(){
  web.end();
  ws.closeAll();
  ws.enable(false);
}

bool wifiOtaEnable(){
  if(config.fWOTA){
    ArduinoOTA.setHostname(config.hname);
    ArduinoOTA.setPasswordHash(config.upass);
    ArduinoOTA.begin();

    ArduinoOTA
      .onStart([]()
      {
        String type;
        if (ArduinoOTA.getCommand() == U_FLASH)
            type = "sketch";
        else // U_SPIFFS
            type = "filesystem";
            SPIFFS.end();
        log_manager->warn(PSTR(__func__),PSTR("Starting OTA %s\n"), type.c_str());
      })
      .onEnd([]()
      {
        log_manager->warn(PSTR(__func__),PSTR("Device rebooting...\n"));
        reboot();
      })
      .onProgress([](unsigned int progress, unsigned int total)
      {
        log_manager->warn(PSTR(__func__),PSTR("OTA progress: %d/%d\n"), progress, total);
      })
      .onError([](ota_error_t error)
      {
        log_manager->warn(PSTR(__func__),PSTR("OTA Failed: %d\n"), error);
        reboot();
      }
    );
    return true;
  }
  return false;
}

void wifiOtaLoopCb(){
  ArduinoOTA.handle();
}

void wifiOtaDisable(){
  ArduinoOTA.end();
}

void tbLoopCb(){
  tb.loop();
}
void tbLoopDisable(){
  tb.disconnect();
}

bool tbKeeperEnable(){
  if(!config.fIoT){
    return false;
  }

  int freeHeap = ESP.getFreeHeap();
  log_manager->info(PSTR(__func__),PSTR("Initializing IoT, available memory: %d\n"), freeHeap);
  if(freeHeap < 92000)
  {
    log_manager->warn(PSTR(__func__),PSTR("Unable to init IoT, insufficient memory: %d\n"), freeHeap);
    return false;
  }

  if(!WiFi.isConnected()){
    log_manager->warn(PSTR(__func__),PSTR("Unable to init IoT, WiFi is not connected!\n"));
    return false;
  }

  tb.setBufferSize(DOCSIZE_MIN);

  tbLoop.setInterval(25 * TASK_MILLISECOND);
  tbLoop.setIterations(TASK_FOREVER);
  tbLoop.enable();
  return true;
}
void tbKeeperCb(){
  if(!config.provSent)
  {
    tbKeeper.setCallback(tbKeeperProvCb);
    tbKeeper.forceNextIteration();
  }
  else{
    if(!tb.connected())
    {
      log_manager->info(PSTR(__func__),PSTR("Connecting to broker %s:%d\n"), config.broker, config.port);
      if(!tb.connect(config.broker, config.accTkn, config.port, config.name))
      {
        config.tbDisco++;
        log_manager->warn(PSTR(__func__),PSTR("Failed to connect to IoT Broker %s (%d)\n"), config.broker, config.tbDisco);
        StaticJsonDocument<1> doc;
        JsonObject params = doc.template as<JsonObject>();
        runCb("onTbDisconnected", params);
        if(config.tbDisco >= 10){
          config.provSent = 0;
          config.tbDisco = 0;
        }
        return;
      }
      StaticJsonDocument<1> doc;
      JsonObject params = doc.template as<JsonObject>();
      runCb("onTbConnected", params);
      setAlarm(0, 0, 3, 100);
      log_manager->info(PSTR(__func__),PSTR("IoT Connected!\n"));
    }
  }
}

void tbKeeperProvCb(){
  log_manager->info(PSTR(__func__),PSTR("Starting provision initiation to %s:%d\n"),  config.broker, config.port);
  if(tb.connect(config.broker, "provision", config.port))
  {
    log_manager->info(PSTR(__func__),PSTR("Connected to provisioning server: %s:%d\n"),  config.broker, config.port);

    GenericCallback cb[2] = {
      { "provisionResponse", processProvisionResponse },
      { "provisionResponse", processProvisionResponse }
    };
    if(tb.callbackSubscribe(cb, 2))
    {
      if(tb.sendProvisionRequest(config.name, config.provDK, config.provDS))
      {
        log_manager->info(PSTR(__func__),PSTR("Provision request was sent! Waiting for response.\n"));
      }
    }
  }
  else
  {
    log_manager->warn(PSTR(__func__),PSTR("Failed to connect to provisioning server: %s:%d\n"),  config.broker, config.port);
    return;
  }
}

void tbKeeperDisable(){
  tbLoop.disable();
}

void emitAlarm(int code){
  StaticJsonDocument<DOCSIZE_MIN> doc;
  doc["alarm"] = code;
  tb.sendTelemetryDoc(doc);
  log_manager->error(PSTR(__func__), PSTR("%i\n"), code);
  JsonObject params = doc.template as<JsonObject>();
  runCb("emitAlarmWs", params);
}

void rtcUpdate(long ts){
  if(ts == 0){
    configTime(config.gmtOff, 0, "pool.ntp.org");
    struct tm timeinfo;
    if (getLocalTime(&timeinfo)){
      rtc.setTimeStruct(timeinfo);
      log_manager->debug(PSTR(__func__), PSTR("Updated time via NTP: %s GMT Offset:%d (%d) \n"), rtc.getDateTime().c_str(), config.gmtOff, config.gmtOff / 3600);
    }
  }else{
      rtc.setTime(ts);
      log_manager->debug(PSTR(__func__), PSTR("Updated time via timestamp: %s\n"), rtc.getDateTime().c_str());
  }
}

void cbWifiOnConnected(WiFiEvent_t event, WiFiEventInfo_t info)
{
  log_manager->info(PSTR(__func__),PSTR("WiFi Connected to %s\n"), WiFi.SSID().c_str());
}

void cbWiFiOnDisconnected(WiFiEvent_t event, WiFiEventInfo_t info)
{
  log_manager->warn(PSTR(__func__),PSTR("WiFi (%s and %s) Disconnected!\n"), config.wssid, config.dssid);
  if(config.fIoT){
    tbKeeper.disable();
  }
  if(config.fIface){
    ifaceLoop.disable();
  }
  if(config.fWOTA){
    wifiOtaLoop.disable();
  }
}

void cbWiFiOnLostIp(WiFiEvent_t event, WiFiEventInfo_t info)
{
  log_manager->warn(PSTR(__func__),PSTR("WiFi (%s) IP Lost!\n"), WiFi.SSID().c_str());
}

void cbWiFiOnGotIp(WiFiEvent_t event, WiFiEventInfo_t info)
{
  IPAddress ip = WiFi.localIP();
  char ipa[25];
  sprintf(ipa, "%d.%d.%d.%d", ip[0], ip[1], ip[2], ip[3]);
  log_manager->warn(PSTR(__func__),PSTR("WiFi (%s) IP Assigned: %s!\n"), WiFi.SSID().c_str(), ipa);

  ssl.setCACert(CA_CERT);

  MDNS.begin(config.hname);
  MDNS.addService("http", "tcp", 80);
  log_manager->info(PSTR(__func__),PSTR("Started MDNS on %s\n"), config.hname);

  rtcUpdate(0);
  if(config.fWOTA){
    wifiOtaLoop.enable();
  }

  if(config.fIface){
    ifaceLoop.enable();
  }

  if(config.fIoT){
    tbKeeper.enable();
  }

  setAlarm(0, 0, 3, 100);
}

