Narin-Laboratory/libudawa-esp32/src/libudawa.h
bool wifiKeeperEnable()
{
  log_manager->debug(PSTR(__func__),PSTR("Initializing wifi network...\n"));
  WiFi.mode(WIFI_STA);
  WiFi.setHostname(config.hname);
  WiFi.setAutoReconnect(true);
  if(!config.wssid || *config.wssid == 0x00 || strlen(config.wssid) > 32)
  {
    configLoadFailSafe();
    log_manager->warn(PSTR(__func__), PSTR("SSID too long or missing! Failsafe config was loaded.\n"));
  }
  wifiMulti.addAP(config.wssid, config.wpass);
  wifiMulti.addAP(config.dssid, config.dpass);

  WiFi.onEvent(cbWifiOnConnected, ARDUINO_EVENT_WIFI_STA_CONNECTED);
  WiFi.onEvent(cbWiFiOnDisconnected, ARDUINO_EVENT_WIFI_STA_DISCONNECTED);
  WiFi.onEvent(cbWiFiOnLostIp, ARDUINO_EVENT_WIFI_STA_LOST_IP);
  WiFi.onEvent(cbWiFiOnGotIp, ARDUINO_EVENT_WIFI_STA_GOT_IP);

  return true;
}

void wifiKeeperCb(){
  wifiMulti.run();
}

void onWsEventCb(AsyncWebSocket * server, AsyncWebSocketClient * client, AwsEventType type, void * arg, uint8_t *data, size_t len){
  StaticJsonDocument<DOCSIZE_MIN> doc;
  DeserializationError err = deserializeJson(doc, data);

  if(type == WS_EVT_CONNECT){
    log_manager->debug(PSTR(__func__), PSTR("ws[%s][%u] connect\n"), server->url(), client->id());
    doc["evType"] = (int)WS_EVT_CONNECT;
    JsonObject root = doc.template as<JsonObject>();
    runCb("wsEvent", root);
  } else if(type == WS_EVT_DISCONNECT){
    log_manager->debug(PSTR(__func__), PSTR("ws[%s][%u] disconnect\n"), server->url(), client->id());
    doc["evType"] = (int)WS_EVT_DISCONNECT;
    JsonObject root = doc.template as<JsonObject>();
    runCb("wsEvent", root);
  } else if(type == WS_EVT_ERROR){
    log_manager->warn(PSTR(__func__), PSTR("ws[%s][%u] error(%u): %s\n"), server->url(), client->id(), *((uint16_t*)arg), (char*)data);
    doc["evType"] = (int)WS_EVT_ERROR;
    JsonObject root = doc.template as<JsonObject>();
    runCb("wsEvent", root);
  } else if(type == WS_EVT_PONG){
    doc["evType"] = (int)WS_EVT_PONG;
    JsonObject root = doc.template as<JsonObject>();
    log_manager->debug(PSTR(__func__), PSTR("ws[%s][%u] pong[%u]: %s\n"), server->url(), client->id(), len, (len)?(char*)data:"");
    runCb("wsEvent", root);
  } else if(type == (int)WS_EVT_DATA){
    if (err == DeserializationError::Ok)
    {
      doc["evType"] = (int)WS_EVT_DATA;
      JsonObject root = doc.template as<JsonObject>();
      log_manager->debug(PSTR(__func__), PSTR("WS message parsing %s\n"), err.c_str());
      serializeJsonPretty(doc, Serial);
      runCb("wsEvent", root);
    }
    else
    {
      log_manager->warn(PSTR(__func__), PSTR("WS message parsing error: %s\n"), err.c_str());
    }
  }
}

void udawa() {
  r.execute();
}

void updateSpiffsCb(){
  esp32FOTA esp32FOTA(CURRENT_FIRMWARE_TITLE, CURRENT_FIRMWARE_VERSION);

  CryptoMemAsset  *MyRootCA = new CryptoMemAsset("Root CA", CA_CERT, strlen(CA_CERT)+1 );

  esp32FOTA.setManifestURL(mnfstUrl);
  esp32FOTA.setRootCA(MyRootCA);
  esp32FOTA.setCertFileSystem(nullptr);
  esp32FOTA.setProgressCb( [](size_t progress, size_t size) {
      if( progress == size || progress == 0 ) Serial.println();
      Serial.print(".");
  });
  esp32FOTA.setUpdateCheckFailCb( [](int partition, int error_code) {
    Serial.printf("Update could validate %s partition (error %d)\n", partition==U_SPIFFS ? "spiffs" : "firmware", error_code );
    // error codes:
    //  -1 : partition not found
    //  -2 : validation (signature check) failed
  });
  esp32FOTA.setUpdateBeginFailCb( [](int partition) {

  });
  esp32FOTA.setUpdateEndCb( [](int partition) {

  });
  esp32FOTA.setUpdateFinishedCb( [](int partition, bool restart_after) {
    StaticJsonDocument<1> doc;
    doc["partition"] = partition;
    JsonObject root = doc.template as<JsonObject>();
    configSave();
    configCoMCUSave();
    runCb("onUpdateFinished", root);
  });

  esp32FOTA.execHTTPcheck();
  esp32FOTA.execOTASPIFFS();
}

void setBuzzer(int32_t beepCount, uint16_t beepDelay){
  StaticJsonDocument<DOCSIZE_MIN> doc;
  JsonObject params = doc.createNestedObject("params");
  doc["method"] = "sBuz";
  params["beepCount"] = beepCount;
  params["beepDelay"] = beepDelay;
  serialWriteToCoMcu(doc, 0);
}

void setLed(uint8_t r, uint8_t g, uint8_t b, uint8_t isBlink, int32_t blinkCount, uint16_t blinkDelay){
  StaticJsonDocument<DOCSIZE_MIN> doc;
  JsonObject params = doc.createNestedObject("params");
  params["r"] = r;
  params["g"] = g;
  params["b"] = b;
  params["isBlink"] = isBlink;
  params["blinkCount"] = blinkCount;
  params["blinkDelay"] = blinkDelay;
  serialWriteToCoMcu(doc, 0);
}

void setLed(uint8_t color, uint8_t isBlink, int32_t blinkCount, uint16_t blinkDelay){
uint8_t r, g, b;
  switch (color)
  {
  //Auto by network
  case 0:
    if(tb.connected()){
      r = configcomcu.lON == 0 ? 255 : 0;
      g = configcomcu.lON == 0 ? 255 : 0;
      b = configcomcu.lON;
    }
    else if(WiFi.status() == WL_CONNECTED){
      r = configcomcu.lON == 0 ? 255 : 0;
      g = configcomcu.lON;
      b = configcomcu.lON == 0 ? 255 : 0;
    }
    else{
      r = configcomcu.lON;
      g = configcomcu.lON == 0 ? 255 : 0;
      b = configcomcu.lON == 0 ? 255 : 0;
    }
    break;
  //RED
  case 1:
    r = configcomcu.lON;
    g = configcomcu.lON == 0 ? 255 : 0;
    b = configcomcu.lON == 0 ? 255 : 0;
    break;
  //GREEN
  case 2:
    r = configcomcu.lON == 0 ? 255 : 0;
    g = configcomcu.lON;
    b = configcomcu.lON == 0 ? 255 : 0;
    break;
  //BLUE
  case 3:
    r = configcomcu.lON == 0 ? 255 : 0;
    g = configcomcu.lON == 0 ? 255 : 0;
    b = configcomcu.lON;
    break;
  default:
    r = configcomcu.lON;
    g = configcomcu.lON;
    b = configcomcu.lON;
  }
  StaticJsonDocument<DOCSIZE_MIN> doc;
  doc["method"] = "sLed";
  JsonObject params = doc.createNestedObject("params");
  params["r"] = r;
  params["g"] = g;
  params["b"] = b;
  params["isBlink"] = isBlink;
  params["blinkCount"] = blinkCount;
  params["blinkDelay"] = blinkDelay;
  serialWriteToCoMcu(doc, 0);
}

void setAlarm(uint16_t code, uint8_t color, int32_t blinkCount, uint16_t blinkDelay){
  setLed(color, 1, blinkCount, blinkDelay);
  setBuzzer(blinkCount, blinkDelay);
  if(code > 0){
    emitAlarm(code);
  }
}

void reboot()
{
  log_manager->info(PSTR(__func__),PSTR("Device rebooting...\n"));
  esp_task_wdt_init(1,true);
  esp_task_wdt_add(NULL);
  while(true);
}

char* getDeviceId()
{
  char* decodedString = new char[16];
  uint64_t chipid = ESP.getEfuseMac();
  sprintf(decodedString, "%04X%08X",(uint16_t)(chipid>>32), (uint32_t)chipid);
  return decodedString;
}

