Narin-Laboratory/libudawa-esp32/src/libudawa.h
void configReset()
{
  /*bool formatted = SPIFFS.format();
  if(formatted)
  {
    log_manager->info(PSTR(__func__),PSTR("SPIFFS formatting success.\n"));
  }
  else
  {
    log_manager->warn(PSTR(__func__),PSTR("SPIFFS formatting failed.\n"));
  }*/
  File file;
  file = SPIFFS.open(configFile, FILE_WRITE);
  if (!file) {
    log_manager->warn(PSTR(__func__),PSTR("Failed to create config file. Config reset is cancelled.\n"));
    file.close();
    return;
  }

  StaticJsonDocument<DOCSIZE> doc;

  char dv[16];
  sprintf(dv, "%s", getDeviceId());
  doc["name"] = "UDAWA" + String(dv);
  doc["model"] = "Generic";
  doc["group"] = "UDAWA";
  doc["broker"] = broker;
  doc["port"] = port;
  doc["wssid"] = wssid;
  doc["wpass"] = wpass;
  doc["dssid"] = dssid;
  doc["dpass"] = dpass;
  doc["upass"] = upass;
  doc["accTkn"] = accTkn;
  doc["provSent"] = false;
  doc["provDK"] = provDK;
  doc["provDS"] = provDS;
  doc["logLev"] = 5;
  doc["gmtOff"] = 28880;

  doc["fIoT"] = 1;
  doc["fWOTA"] = 1;
  doc["fIface"] = 1;

  doc["hname"] = "UDAWA" + String(dv) + ".local";

  doc["htU"] = "UDAWA";
  doc["htP"] = "defaultkey";

  size_t size = serializeJson(doc, file);
  file.close();

  log_manager->info(PSTR(__func__),PSTR("Resetted config file (size: %d) is written successfully...\n"), size);
  file = SPIFFS.open(configFile, FILE_READ);
  if (!file)
  {
    log_manager->warn(PSTR(__func__),PSTR("Failed to open the config file!"));
  }
  else
  {
    log_manager->info(PSTR(__func__),PSTR("New config file opened, size: %d\n"), file.size());

    if(file.size() < 1)
    {
      log_manager->warn(PSTR(__func__),PSTR("Config file size is abnormal: %d, trying to rewrite...\n"), file.size());

      size_t size = serializeJson(doc, file);
      log_manager->info(PSTR(__func__),PSTR("Writing: %d of data, file size: %d\n"), size, file.size());
    }
    else
    {
      log_manager->info(PSTR(__func__),PSTR("Config file size is normal: %d, trying to reboot...\n"), file.size());
      file.close();
      reboot();
    }
  }
  file.close();
}

void configLoadFailSafe()
{
  char dv[16];
  sprintf(dv, "%s", getDeviceId());
  strlcpy(config.hwid, dv, sizeof(config.hwid));

  String name = "UDAWA" + String(dv);
  strlcpy(config.name, name.c_str(), sizeof(config.name));
  strlcpy(config.model, "Generic", sizeof(config.model));
  strlcpy(config.group, "UDAWA", sizeof(config.group));
  strlcpy(config.broker, broker, sizeof(config.broker));
  strlcpy(config.wssid, wssid, sizeof(config.wssid));
  strlcpy(config.wpass, wpass, sizeof(config.wpass));
  strlcpy(config.dssid, dssid, sizeof(config.dssid));
  strlcpy(config.dpass, dpass, sizeof(config.dpass));
  strlcpy(config.upass, upass, sizeof(config.upass));
  strlcpy(config.accTkn, accTkn, sizeof(config.accTkn));
  config.provSent = false;
  config.port = port;
  strlcpy(config.provDK, provDK, sizeof(config.provDK));
  strlcpy(config.provDS, provDS, sizeof(config.provDS));
  config.logLev = 5;
  config.gmtOff = 28800;

  config.fIoT = 1;
  config.fWOTA = 1;
  config.fIface = 1;
  String hname = "UDAWA" + String(dv) + ".local";
  strlcpy(config.hname, hname.c_str(), sizeof(config.hname));
  strlcpy(config.htU, "UDAWA", sizeof(config.htU));
  strlcpy(config.htP, "defaultkey", sizeof(config.htP));
}

void configLoad()
{
  File file = SPIFFS.open(configFile, FILE_READ);
  log_manager->info(PSTR(__func__),PSTR("Loading config file.\n"));
  if(file.size() > 1)
  {
    log_manager->info(PSTR(__func__),PSTR("Config file size is normal: %d, trying to fit it in %d docsize.\n"), file.size(), DOCSIZE);
  }
  else
  {
    file.close();
    log_manager->warn(PSTR(__func__),PSTR("Config file size is abnormal: %d. Closing file and trying to reset...\n"), file.size());
    configReset();
    return;
  }

  StaticJsonDocument<DOCSIZE> doc;
  DeserializationError error = deserializeJson(doc, file);

  if(error)
  {
    log_manager->warn(PSTR(__func__),PSTR("Failed to load config file! (%s - %s - %d). Falling back to failsafe.\n"), configFile, error.c_str(), file.size());
    file.close();
    configLoadFailSafe();
    return;
  }
  else
  {
    char dv[16];
    sprintf(dv, "%s", getDeviceId());
    strlcpy(config.hwid, dv, sizeof(config.hwid));

    log_manager->info(PSTR(__func__),PSTR("Device ID: %s\n"), dv);


    String name = "UDAWA" + String(dv);
    strlcpy(config.name, name.c_str(), sizeof(config.name));
    //strlcpy(config.name, doc["name"].as<const char*>(), sizeof(config.name));
    strlcpy(config.model, doc["model"].as<const char*>(), sizeof(config.model));
    strlcpy(config.group, doc["group"].as<const char*>(), sizeof(config.group));
    strlcpy(config.broker, doc["broker"].as<const char*>(), sizeof(config.broker));
    strlcpy(config.wssid, doc["wssid"].as<const char*>(), sizeof(config.wssid));
    strlcpy(config.wpass, doc["wpass"].as<const char*>(), sizeof(config.wpass));
    strlcpy(config.dssid, doc["dssid"].as<const char*>(), sizeof(config.dssid));
    strlcpy(config.dpass, doc["dpass"].as<const char*>(), sizeof(config.dpass));
    strlcpy(config.upass, doc["upass"].as<const char*>(), sizeof(config.upass));
    strlcpy(config.accTkn, doc["accTkn"].as<const char*>(), sizeof(config.accTkn));
    config.provSent = doc["provSent"].as<int>();
    config.port = doc["port"].as<uint16_t>() ? doc["port"].as<uint16_t>() : port;
    config.logLev = doc["logLev"].as<uint8_t>();
    config.gmtOff = doc["gmtOff"].as<int>();
    strlcpy(config.provDK, doc["provDK"].as<const char*>(), sizeof(config.provDK));
    strlcpy(config.provDS, doc["provDS"].as<const char*>(), sizeof(config.provDS));

    config.fIoT = doc["fIoT"].as<bool>();
    config.fWOTA = doc["fWOTA"].as<bool>();
    config.fIface = doc["fIface"].as<bool>();
    strlcpy(config.hname, doc["hname"].as<const char*>(), sizeof(config.hname));
    strlcpy(config.htU, doc["htU"].as<const char*>(), sizeof(config.htU));
    strlcpy(config.htP, doc["htP"].as<const char*>(), sizeof(config.htP));

    log_manager->info(PSTR(__func__),PSTR("Config loaded successfuly.\n"));
  }
  file.close();
}

void configSave()
{
  if(!SPIFFS.remove(configFile))
  {
    log_manager->warn(PSTR(__func__),PSTR("Failed to delete the old configFile: %s\n"), configFile);
  }
  File file = SPIFFS.open(configFile, FILE_WRITE);
  if (!file)
  {
    file.close();
    return;
  }

  StaticJsonDocument<DOCSIZE> doc;
  doc["name"] = config.name;
  doc["model"] = config.model;
  doc["group"] = config.group;
  doc["broker"] = config.broker;
  doc["port"]  = config.port;
  doc["wssid"] = config.wssid;
  doc["wpass"] = config.wpass;
  doc["dssid"] = config.dssid;
  doc["dpass"] = config.dpass;
  doc["upass"] = config.upass;
  doc["accTkn"] = config.accTkn;
  doc["provSent"] = config.provSent;
  doc["provDK"] = config.provDK;
  doc["provDS"] = config.provDS;
  doc["logLev"] = config.logLev;
  doc["gmtOff"] = config.gmtOff;

  doc["fIoT"] = config.fIoT;
  doc["fWOTA"] = config.fWOTA;
  doc["fIface"] = config.fIface;
  doc["hname"] = config.hname;
  doc["htU"] = config.htU;
  doc["htP"] = config.htP;

  serializeJson(doc, file);
  file.close();
}


void configCoMCUReset()
{
  SPIFFS.remove(configFileCoMCU);
  File file = SPIFFS.open(configFileCoMCU, FILE_WRITE);
  if (!file) {
    file.close();
    return;
  }

  StaticJsonDocument<DOCSIZE> doc;

